[
    {
        "id":"Booki",
        "cover":"https://strapi-h2ev.onrender.com/uploads/Booki_Cover_Image_edb0369b75.webp",
        "title":"Booki",
        "description":"Booki est un projet de site web de réservation de logements et d'activités que j'ai réalisé avec passion. Inspiré par des plateformes telles qu'Airbnb, Booki vise à offrir une expérience utilisateur fluide et intuitive, tout en mettant en avant mes compétences en design web et en intégration. Pour donner vie à Booki, j'ai utilisé uniquement HTML et CSS. Cela signifie que le site est statique, mais chaque pixel a été soigneusement pensé pour garantir une mise en page responsive et une compatibilité multi-navigateurs, assurant ainsi une expérience utilisateur optimale sur tous les appareils. Bien que Booki ne soit pas encore fonctionnel dans son état actuel, il offre un aperçu fidèle de ce à quoi il ressemblera une fois opérationnel. Les visiteurs peuvent parcourir les différentes pages pour découvrir les logements et les activités proposés, tout en se familiarisant avec l'interface intuitive que j'ai conçue. Le respect de la maquette a été essentiel dans le développement de Booki. Chaque détail visuel a été méticuleusement aligné et stylisé pour correspondre aux spécifications du design, garantissant ainsi une cohérence esthétique à travers tout le site. Avec Booki, je voulais mettre en valeur mes compétences en design web et en intégration, tout en démontrant ma capacité à suivre des directives précises pour concrétiser une vision créative. Ce projet représente une étape importante de mon parcours en tant que développeuse web, et je suis impatiente de partager mes réalisations avec vous.",
        "link":"https://darlene-moundounga.github.io/OC-P2-Booki/",
        "tags":["HTML", "CSS"],
        "images":["https://i.ibb.co/M5jkh4K/1.png","https://i.ibb.co/DW9Pm2b/2.png","https://i.ibb.co/Lz7WsDx/3.png"]
    },

    {
        "id":"SophieBluel-Portfolio",
        "cover":"https://strapi-h2ev.onrender.com/uploads/Sophie_Bluel_Cover_Image_900e348e98.webp",
        "title":"Sophie Bluel-Portfolio",
        "description":"Ce projet représente une collaboration passionnante où j'ai eu l'opportunité de créer une page web dynamique pour le site internet d'une talentueuse architecte d'intérieur. Mon objectif était de fournir une expérience en ligne immersive pour présenter ses travaux de manière élégante et engageante. Pour réaliser ce projet, j'ai exploité toute la puissance de JavaScript, en mettant l'accent sur le développement front-end. J'ai utilisé JavaScript pour communiquer avec une API, gérer les événements utilisateur et manipuler les éléments du DOM. Cette approche m'a permis de créer des interactions fluides et intuitives, offrant ainsi une expérience utilisateur optimale. En plus de la page dynamique de présentation des travaux de l'architecte, j'ai développé une page de connexion pour l'administrateur du site. De plus, j'ai intégré une modale permettant d'uploader (de télécharger) de nouveaux médias, offrant ainsi à l'administrateur un moyen pratique de mettre à jour le contenu du site. Ce projet m'a permis de mettre en pratique mes compétences en JavaScript de manière approfondie. En travaillant sur la partie front-end du site, j'ai eu l'occasion de créer des solutions innovantes et sur mesure, parfaitement adaptées aux besoins spécifiques de Sophie Bluel. Le Portfolio de Sophie Bluel représente non seulement une réalisation technique, mais aussi une expérience d'apprentissage enrichissante. En ayant accès à un code back-end pour tester les fonctionnalités et en apprenant à communiquer avec une API, j'ai acquis des compétences précieuses pour les applications web modernes. Ce projet incarne ma passion pour le développement web et mon engagement à créer des solutions innovantes et impactantes pour mes clients.",
        "link":"https://github.com/Darlene-Moundounga/P3-Portfolio-SB/",
        "tags":["HTML", "CSS", "Javascript", "API"],
        "images":["https://i.ibb.co/wS3Lk4c/1.png","https://i.ibb.co/G262JJx/2.png"]
    },

    {
        "id":"NinaCarducci-Photographie",
        "cover":"https://www.cams-code-projects.com/img-projects/nina-carducci/nina-carducci-cover.webp",
        "title":"Nina Carducci-Photographie",
        "description":"Dans ce projet, j'ai eu le privilège de travailler sur l'amélioration des performances et de l'accessibilité d'un site web existant, dans le but ultime d'optimiser son référencement sur les moteurs de recherche. J'ai du optimiser les problèmes potentiels de chargement et de référencement du site en utilisant des outils de diagnostic tels que Lighthouse et Wave pour évaluer objectivement les performances actuelles du site ainsi que son niveau d'accessibilité. J'ai également du faire quelques modifications au sein du code afin de débugger le site sur certains points, comme me l'a demandé le client.Ce projet représente bien plus qu'une simple optimisation technique. Il incarne mon engagement à fournir des solutions pragmatiques et efficaces pour améliorer la visibilité en ligne d'un site web. Grâce à mon expertise en développement web et à ma capacité à comprendre les exigences spécifiques du référencement et de l'accessibilité, j'ai pu transformer un site existant en une véritable vitrine numérique, prête à attirer un public plus large et à offrir une expérience utilisateur enrichie.",
        "link":"https://github.com/Darlene-Moundounga/darlene.github.io",
        "tags":["Ligthouse", "SEO","Référencement","Accessibilité","Performances"],
        "images":["https://i.ibb.co/TRGrs2Z/1.png","https://i.ibb.co/QFCRSv1/2.png","https://i.ibb.co/CbB9BbC/Design-sans-titre-3.png"]
    },
    
    {
        "id":"Kasa",
        "cover":"https://strapi-h2ev.onrender.com/uploads/Kasa_Showcase_Image_8f93a1690f.webp",
        "title":"Kasa",
        "description":"Kasa est un projet où j'ai pu démontrer mes compétences en tant que développeuse web en réalisant le front-end d'une application utilisant React, une technologie innovante pour créer des interfaces web modernes et réactives.J'ai donc créer l'interface visible par les utilisateurs de l'application Kasa. J'ai travaillé sur la présentation des données et la création des différentes sections de l'application. Mon objectif principal était de rendre l'expérience utilisateur aussi fluide et intuitive que possible.Pour créer l'interface utilisateur de Kasa, je me suis basée sur des maquettes fournies par l'équipe de design. Ces maquettes m'ont guidée dans la création des différentes composantes visuelles de l'application, en veillant à ce qu'elles correspondent parfaitement à la vision créative du projet.Ce projet a été une expérience enrichissante qui m'a permis de mettre en pratique mes compétences en développement web. En créant l'interface utilisateur de Kasa, j'ai démontré ma capacité à transformer des concepts abstraits en une expérience concrète et fonctionnelle pour les utilisateurs. Mon objectif est toujours de créer des interfaces web qui offrent une expérience utilisateur optimale, et je suis fière du travail accompli sur ce projet.",
        "link":"https://github.com/Darlene-Moundounga/Kasa",
        "tags":["SASS","ReactJS"],
        "images":["https://i.ibb.co/7yz4QJJ/1.png","https://i.ibb.co/4F1D87r/2.png","https://i.ibb.co/thzcmTQ/3.png"]
    },
    {
        "id":"MonVieuxGrimoire",
        "cover":"https://strapi-h2ev.onrender.com/uploads/Vieux_Grimoire_Showcase_Image_4f4a3b5f10.webp",
        "title":"Mon Vieux Grimoire",
        "description":"Grâce à ce projet, j'ai eu l'opportunité de déployer mes compétences en développement back-end pour créer un site de notation de livres. Mon rôle consistait à mettre en place toute l'infrastructure serveur à l'aide de NodeJS (combiné à ExpressJS) et à le connecter à une base de données MongoDB, tout en assurant la sécurité des données et la convivialité de l'application. Une part importante de mon travail a été de développer les modèles de données pour représenter les livres et les notations, ainsi que d'implémenter les opérations CRUD (Créer, Lire, Mettre à jour, Supprimer) pour gérer ces données de manière efficace. J'ai veillé à ce que toutes les opérations soient sécurisées et conformes aux bonnes pratiques de stockage des données. Un aspect crucial du projet était la mise en place d'un système d'authentification sécurisé pour les utilisateurs du site. J'ai développé un système d'authentification robuste, en utilisant des techniques telles que JWT (JSON Web Tokens) pour garantir la sécurité des données et la protection des comptes utilisateurs. En plus de la gestion des livres et des notations, j'ai également mis en œuvre des fonctionnalités pour le téléchargement et l'optimisation des images. Dans le cadre de ce projet, j'ai veillé à respecter les bonnes pratiques du Green Code pour réduire l'empreinte écologique du site. Ce projet a été une expérience enrichissante qui m'a permis de mettre en pratique mes compétences en développement back-end. En créant l'infrastructure serveur de Mon Vieux Grimoire, j'ai démontré ma capacité à concevoir et à mettre en œuvre des solutions techniques robustes et sécurisées. Mon objectif est toujours de fournir des applications web performantes, sécurisées et respectueuses de l'environnement, et je suis fière du travail accompli sur ce projet.",
        "link":"https://github.com/Darlene-Moundounga/P7-Library",
        "tags":["NodeJS","ExpressJS","MongoDB"],
        "images":["https://i.ibb.co/Q9dxKD3/1.png","https://i.ibb.co/Ykdp3XB/2.png","https://i.ibb.co/P9jMLMg/3.png"]
    }
    
]